Tekla.Structures.Model.Component
The Component class represents a component. A component is a modelling tool that typically
assembles multiple parts to build some type of a structure, for example a hall macro or at a
smaller scale a reinforcement component (a macro). Also, a custom part is a component.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam B = new Beam(new Point(12000, 0, 0), new Point(12000, 0, 6000));
B.Profile.ProfileString = "380*380";
B.Material.MaterialString = "K40-1";
if (B.Insert())
{
Component C = new Component();
C.Name = "Component Test";
C.Number = 30000063;
ComponentInput CI = new ComponentInput();
CI.AddInputObject(B);
C.SetComponentInput(CI);
C.LoadAttributesFromFile("standard");
C.SetAttribute("side_bar_space", 333.0);
if (!C.Insert())
{
Console.WriteLine("Component Insert failed");
}
else
{
Console.WriteLine(C.Identifier.ID);
Double DValue = 0.0;
if (!C.GetAttribute("side_bar_space", ref DValue) || DValue != 333)
Console.WriteLine("Component GetAttribute failed");
}
}
}
}